# Taps
tap "d12frosted/emacs-plus" # emacs-plus

# Terminal utils
brew "coreutils"
brew "moreutils"
brew "starship"
brew "ripgrep"
brew "lazygit"
brew "zoxide"
brew "zellij"
brew "cmake"
brew "xmake"
brew "tmux"
brew "make"
brew "less"
brew "stow"
brew "eza"
brew "fzf"
brew "jq"

# Window Management
cask "nikitabobko/tap/aerospace"

# Programming Languages
# brew "zig", args: [ "HEAD" ]
brew "python-lsp-server"
brew "python@3.13"
brew "armadillo"
brew "ruff-lsp"
brew "openblas"
brew "raylib"
cask "mactex"
brew "black"
brew "node"
brew "rust"
brew "gcc"
brew "go"
brew "uv"

# Terms
cask "wezterm"
cask "ghostty"
# cask "warp"

# Browsers
cask "zen-browser"

# Editors/Git
brew "emacs-plus@30", args: ["with-native-comp"]
cask "visual-studio-code"
cask "sublime-text"
cask "arduino-ide"
cask "mplabx-ide"
cask "github"
brew "neovim"
cask "zed"
brew "gh"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"

# Misc
cask "microsoft-office"
cask "hp-easy-start"
cask "google-drive"
cask "epic-games"
cask "bitwarden"
cask "whatsapp"
cask "raycast"
cask "spotify"
cask "notion"
cask "shottr"
cask "steam"
brew "yazi"
brew "htop"
cask "zoom"
cask "ibkr"
brew "mpv"

