# Taps
tap "d12frosted/emacs-plus" # emacs-plus

# Terminal utils
brew "tree-sitter"
brew "coreutils"
brew "moreutils"
brew "pygments"
brew "starship"
brew "ripgrep"
brew "lazygit"
brew "zoxide"
brew "zellij"
# brew "ollama"
brew "cmake"
brew "xmake"
brew "nmap"
brew "wget"
brew "tmux"
brew "make"
brew "less"
brew "stow"
brew "eza"
brew "fzf"
brew "fd"
brew "jq"

# Window Management
cask "nikitabobko/tap/aerospace"

# Programming Languages
brew "llvm"# , args: ["with-toolchain"]
# brew "llvm", args: ["with-toolchain"]
brew "python-lsp-server"
brew "python@3.13"
brew "pkg-config"
brew "armadillo"
brew "ruff-lsp"
# brew "tectonic" # A XeTeX engine
brew "pybind11"
brew "openblas"
# brew "roswell"
brew "raylib"
brew "ta-lib"
cask "mactex"
brew "black"
brew "boost"
brew "opam"
brew "node"
brew "rust"
# brew "odin"
# brew "sbcl"
# brew "zig"
# brew "zls"
brew "gcc"
brew "go"
brew "uv"

# Terms
# cask "wezterm"
cask "ghostty"
# cask "kitty"
cask "warp"

# Browsers
cask "zen"
cask "firefox"

# Editors/Git
# brew "emacs-plus@30", args: ["with-native-comp", "with-tree-sitter"]
cask "visual-studio-code"
brew "emacs-plus@30"
cask "sublime-text"
cask "arduino-ide"
cask "mplabx-ide"
cask "mplab-xc8"
brew "git-lfs"
cask "github"
brew "neovim"
# cask "spyder"
cask "zed"
brew "gh"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"

# Misc
cask "microsoft-office"
cask "grandperspective"
cask "microsoft-teams"
cask "readdle-spark"
cask "hp-easy-start"
cask "google-drive"
cask "tradingview"
# cask "notion-mail"
cask "epic-games"
cask "bitwarden"
cask "whatsapp"
cask "freetube"
# cask "corretto" # Amazon JDK
brew "sevenzip"
cask "antinote"
cask "postman"
cask "raycast"
cask "spotify"
cask "aldente"
cask "notion"
cask "shottr"
cask "steam"
brew "yazi"
brew "htop"
cask "zoom"
cask "ibkr"
cask "gimp"
cask "iina" # Video player
# brew "mpv"
