# Taps
tap "d12frosted/emacs-plus" # emacs-plus
# tap "deskflow/homebrew-tap" # software KVM
tap "oven-sh/bun" # bun

# Terminal utils
brew "tree-sitter"
brew "coreutils"
brew "moreutils"
brew "pygments"
brew "ripgrep"
brew "autossh"
brew "sshpass"
brew "lazygit"
# brew "euporie" # View Jupyter Notebooks in terminal
brew "zoxide"
brew "portal" # Send files to other devices
brew "atuin"
brew "nmap"
brew "wget"
brew "tmux"
brew "doxx" # View docx in terminal
brew "make"
brew "less"
brew "stow"
brew "yazi"
brew "htop"
brew "e1s" # AWS ECS TUI manager
brew "act" # Run GitHub Actions locally
brew "lsd"
brew "fzf"
brew "fd"
brew "jq"

# Window Management
cask "karabiner-elements"
cask "leader-key"
# brew "deskflow"
cask "dockdoor" # App switcher

# Programming Languages
brew "llvm"# , args: ["with-toolchain"]
brew "python-lsp-server"
brew "python@3.13"
brew "pkg-config"
brew "armadillo"
brew "ruff-lsp"
# brew "tectonic" # A XeTeX engine
brew "pybind11"
brew "openblas"
# brew "roswell"
brew "raylib"
brew "ta-lib"
cask "mactex"
brew "boost"
brew "cmake"
brew "black"
brew "opam"
brew "node"
brew "rust"
brew "gcc"
brew "zig"
brew "bun"
brew "go"
brew "uv"
brew "ty"

# Terms
# cask "wezterm"
brew "libvterm"
cask "ghostty"
# cask "kitty"

# Browsers
cask "brave-browser"
cask "chatgpt-atlas"
cask "zen"

# AI
cask "claude-code"
cask "chatgpt"
cask "claude"
cask "codex"

# Editors/Git
brew "emacs-plus@31", args: ["with-compress-install"]
cask "visual-studio-code"
brew "tree-sitter-cli"
cask "sublime-text"
# cask "arduino-ide"
cask "mplabx-ide"
cask "mplab-xc8"
cask "datagrip"
brew "git-lfs"
cask "github"
brew "neovim"
cask "zed"
brew "gh"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-source-code-pro"
cask "font-iosevka"

# Misc
cask "microsoft-powerpoint"
cask "raspberry-pi-imager"
cask "nvidia-geforce-now"
cask "grandperspective"
cask "microsoft-teams"
cask "microsoft-excel"
cask "notion-calendar"
cask "the-unarchiver"
cask "microsoft-word"
cask "docker-desktop"
# cask "readdle-spark"
cask "hp-easy-start"
cask "google-drive"
# cask "tradingview"
cask "notion-mail"
# cask "epic-games"
cask "bitwarden"
cask "whatsapp"
# cask "todoist"
# cask "obsidian"
# cask "antinote"
cask "postman"
cask "raycast"
cask "spotify"
# cask "aldente"
cask "notion"
brew "docker"
# cask "shottr"
cask "mqttx"
cask "steam"
cask "zoom"
# cask "ibkr"
cask "gimp"
cask "iina" # Video player
# brew "mpv"
